var map;
var currentMarker;
var locationsHash = {};

//initilize the map and the starting values (centered on Israel) - Including autocomplete, directions and markers
function initialize() {
  directionsDisplay = new google.maps.DirectionsRenderer();
  var latlng = new google.maps.LatLng(46.157858, 13.010011);
  var mapOptions = {
    zoom: 2,
    center: latlng
  };
  map = new google.maps.Map(document.getElementById('map'), mapOptions);
  addMarkers();
}

///////////////////////////////////
//Creating the markers on the map//
///////////////////////////////////

//reads a list of markers from the "add-markers" input field and adds them to the map
function addMarkers(){
  parseOrigins();
  for(var i=0; i<origins.length; i++){
    var locationData = {};
    locationData.latlng = {lat: origins[i].D, lng: origins[i].E};
    locationData.title = origins[i].B;
    if(origins[i].C)
      locationData.title+= ", "+ origins[i].C;
    locationData.contentString = '<div id="content">'+
          '<div id="siteNotice">'+
          '</div><br>'+
          '<h1 id="firstHeading" class="firstHeading">'+ locationData.title +'</h1>'+
          '<div id="bodyContent">'+
          '<p>'+
          locationsHash[locationData.title]+
          '</p>'+
          '</div>';
    addMarker(locationData);
  }
}

// Adds a marker to the map and push to the array.
function addMarker(locationData) {
  var marker = new google.maps.Marker({
    position: locationData.latlng,
    map: map,
    title: locationData.title,
    icon: "http://maps.google.com/mapfiles/kml/pal2/icon13.png"
  });

  marker.infowindow = new google.maps.InfoWindow({
    content: locationData.contentString
  });

  marker.addListener('click', function() {
    if(currentMarker)
      currentMarker.infowindow.close();
    currentMarker = marker;
    currentMarker.infowindow.open(map, currentMarker);
  });
}

function parseOrigins(){
  for(var i=0; i<origins.length; i++){
    var location = origins[i].B;
    if(origins[i].C)
      location+= ", "+origins[i].C;
    if(locationsHash[location])
      locationsHash[location]+= "<br>* "+origins[i].A;
    else
      locationsHash[location]= "<br>* "+origins[i].A;
  }
}

var origins =
[
 {
   "A": "אלחריזי, יהודה",
   "B": "ספרד",
   "C": "טולדו",
   "D": 39.862832,
   "E": -4.027323
 },
 {
   "A": "ז'בוטינסקי, זאב (ולדימיר)",
   "B": "אוקראינה",
   "C": "אודסה",
   "D": 46.482526,
   "E": 30.72331
 },
 {
   "A": "פרוג, שמעון שמואל",
   "B": "אוקראינה",
   "C": "אודסה",
   "D": 46.482526,
   "E": 30.72331
 },
 {
   "A": "כהן, ישראל",
   "B": "אוקראינה",
   "C": "אולאשקובצה",
   "D": 48.899656,
   "E": 25.822301
 },
 {
   "A": "לבונטין, זלמן דוד",
   "B": "רוסיה",
   "C": "אורשה",
   "D": 54.507148,
   "E": 30.411955
 },
 {
   "A": "לבונטין, יחיאל (חושי הארכי)",
   "B": "רוסיה",
   "C": "אורשה",
   "D": 54.507148,
   "E": 30.411955
 },
 {
   "A": "מידניק, אליהו",
   "B": "אוקראינה",
   "C": "אילינצי",
   "D": 49.104001,
   "E": 29.209274
 },
 {
   "A": "מולדר, שמואל ישראל",
   "B": "הולנד",
   "C": "אמסטרדם",
   "D": 52.370216,
   "E": 4.895168
 },
 {
   "A": "ספיר הלוי, יעקב",
   "B": "בלארוס",
   "C": "אשמיאני",
   "D": 54.424346,
   "E": 25.93516
 },
 {
   "A": "כצנלסון, ברל",
   "B": "רוסיה",
   "C": "בוברויסק",
   "D": 53.144607,
   "E": 29.221375
 },
 {
   "A": "שיין, אליעזר",
   "B": "רוסיה",
   "C": "בוברויסק",
   "D": 53.144607,
   "E": 29.221375
 },
 {
   "A": "הרצל, תיאודור (בנימין זאב)",
   "B": "הונגריה",
   "C": "בודפשט",
   "D": 47.497912,
   "E": 19.040235
 },
 {
   "A": "סנש, חנה",
   "B": "הונגריה",
   "C": "בודפשט",
   "D": 47.497912,
   "E": 19.040235
 },
 {
   "A": "סילמן, קדיש",
   "B": "ליטא",
   "C": "בוטרימוניס",
   "D": 54.500926,
   "E": 24.254004
 },
 {
   "A": "לרנר, יעקב",
   "B": "אוקראינה",
   "C": "בז'ז'ני",
   "D": 49.443888,
   "E": 24.93614
 },
 {
   "A": " שטיין, אברהם שמואל (א.ש. שטין)",
   "B": "פולין",
   "C": "ביאליסטוק",
   "D": 53.132489,
   "E": 23.16884
 },
 {
   "A": "דוליצקי, מנחם מנדל",
   "B": "פולין",
   "C": "ביאליסטוק",
   "D": 53.132489,
   "E": 23.16884
 },
 {
   "A": "קפלן, פסח",
   "B": "פולין",
   "C": "ביאליסטוק",
   "D": 53.132489,
   "E": 23.16884
 },
 {
   "A": "שולמאן, קלמן",
   "B": "רוסיה",
   "C": "ביחוב",
   "D": 53.518044,
   "E": 30.240291
 },
 {
   "A": " שריג, יוסף",
   "B": "ישראל",
   "C": "בית השיטה",
   "D": 32.550874,
   "E": 35.439351
 },
 {
   "A": "סדן, דב",
   "B": "אוקראינה",
   "C": "ברודי",
   "D": 50.078807,
   "E": 25.147894
 },
 {
   "A": "ברש, יוליוס",
   "B": "אוקראינה",
   "C": "ברודי",
   "D": 50.078807,
   "E": 25.147894
 },
 {
   "A": " יקותיאלי, יוסף",
   "B": "בלארוס",
   "C": "ברזה קרטוסקה",
   "D": 52.537313,
   "E": 24.978857
 },
 {
   "A": "ברנדשטטר, מרדכי דוד",
   "B": "פולין",
   "C": "בריגל",
   "D": 49.964719,
   "E": 20.603447
 },
 {
   "A": "פוחצ'בסקי, נחמה",
   "B": "בלארוס",
   "C": "בריסק",
   "D": 52.097621,
   "E": 23.73405
 },
 {
   "A": "פיינברג, אבשלום (מכתבים)",
   "B": "ישראל",
   "C": "גדרה",
   "D": 31.812301,
   "E": 34.777019
 },
 {
   "A": "פרידברג, אברהם שלום",
   "B": "בלארוס",
   "C": "גרודנו",
   "D": 53.669354,
   "E": 23.813131
 },
 {
   "A": " כ\"ץ, בן-ציון",
   "B": "ליטא",
   "C": "דאוג",
   "D": 54.361287,
   "E": 24.345351
 },
 {
   "A": "גולומב, אליהו",
   "B": "בלארוס",
   "C": "וולקוביסק",
   "D": 53.151642,
   "E": 24.442203
 },
 {
   "A": "נגב, רחל",
   "B": "פולין",
   "C": "וורשה",
   "D": 52.229676,
   "E": 21.012229
 },
 {
   "A": "שהם, מתתיהו  ",
   "B": "פולין",
   "C": "וורשה",
   "D": 52.229676,
   "E": 21.012229
 },
 {
   "A": "אלפס, בן-ציון",
   "B": "ליטא",
   "C": "וילנה",
   "D": 54.687156,
   "E": 25.279651
 },
 {
   "A": "בן-יהודה, אליעזר",
   "B": "ליטא",
   "C": "וילנה",
   "D": 54.687156,
   "E": 25.279651
 },
 {
   "A": "גורדון, יהודה ליב (יל\"ג)",
   "B": "ליטא",
   "C": "וילנה",
   "D": 54.687156,
   "E": 25.279651
 },
 {
   "A": "לבנזון, אברהם דב בר מיכלישוקר הכהן בן חיים (אד\"ם הכהן)",
   "B": "ליטא",
   "C": "וילנה",
   "D": 54.687156,
   "E": 25.279651
 },
 {
   "A": "סוקולוב, נחום",
   "B": "פולין",
   "C": "וישוגרוד",
   "D": 52.391799,
   "E": 20.190037
 },
 {
   "A": "בר טוביה (שרגא פייבל פרנקל)",
   "B": "אוקראינה",
   "C": "וסיליקוב",
   "D": 50.177089,
   "E": 30.319638
 },
 {
   "A": "אפל, יהודה ליב",
   "B": "ליטא",
   "C": "וקשנה",
   "D": 56.232987,
   "E": 22.515217
 },
 {
   "A": "שץ, בוריס (ברוך)",
   "B": "ליטא",
   "C": "ורניאי",
   "D": 55.741478,
   "E": 22.372331
 },
 {
   "A": "זילברבוש, דוד ישעיהו",
   "B": "אוקראינה",
   "C": "זאלשצ'יקי",
   "D": 48.646993,
   "E": 25.738311
 },
 {
   "A": "פרישמן, דוד",
   "B": "פולין",
   "C": "זגייז'",
   "D": 51.855058,
   "E": 19.40607
 },
 {
   "A": "פרץ, יצחק ליבוש",
   "B": "פולין",
   "C": "זמושץ",
   "D": 50.723088,
   "E": 23.251969
 },
 {
   "A": "ברשדסקי, ישעיהו (דומשביצקי)",
   "B": "רוסיה",
   "C": "זמושץ",
   "D": 53.036036,
   "E": 21.683126
 },
 {
   "A": " שרת, משה",
   "B": "אוקראינה",
   "C": "חרסון",
   "D": 46.635417,
   "E": 32.616867
 },
 {
   "A": "יהודה הלוי (ריה\"ל)",
   "B": "ספרד",
   "C": "טולדו",
   "D": 39.862832,
   "E": -4.027323
 },
 {
   "A": "שטרייט, שלום",
   "B": "אוקראינה",
   "C": "טלומאץ'",
   "D": 48.858803,
   "E": 24.996812
 },
 {
   "A": "גוטלובר, אברהם בר (מהללאל)",
   "B": "אוקראינה",
   "C": "טרנופול",
   "D": 49.553517,
   "E": 25.594767
 },
 {
   "A": "נימנוביץ', נפתלי הרץ ",
   "B": "פולין",
   "C": "יוזפוב",
   "D": 50.48108,
   "E": 23.05406
 },
 {
   "A": "שלוש, יוסף אליהו",
   "B": "ישראל",
   "C": "יפו",
   "D": 32.0853,
   "E": 34.781768
 },
 {
   "A": " חשין, שניאור זלמן",
   "B": "ישראל",
   "C": "ירושלים",
   "D": 31.768319,
   "E": 35.21371
 },
 {
   "A": "בן-אב\"י, איתמר",
   "B": "ישראל",
   "C": "ירושלים",
   "D": 31.768319,
   "E": 35.21371
 },
 {
   "A": "גרייבסקי, פנחס",
   "B": "ישראל",
   "C": "ירושלים",
   "D": 31.768319,
   "E": 35.21371
 },
 {
   "A": "חשין, שניאור זלמן",
   "B": "ישראל",
   "C": "ירושלים",
   "D": 31.768319,
   "E": 35.21371
 },
 {
   "A": "ילין, דוד",
   "B": "ישראל",
   "C": "ירושלים",
   "D": 31.768319,
   "E": 35.21371
 },
 {
   "A": "מיוחס, יוסף",
   "B": "ישראל",
   "C": "ירושלים",
   "D": 31.768319,
   "E": 35.21371
 },
 {
   "A": "ריבלין, יוסף",
   "B": "ישראל",
   "C": "ירושלים",
   "D": 31.768319,
   "E": 35.21371
 },
 {
   "A": "רבינוביץ', אלכסנדר זיסקינד",
   "B": "בלארוס",
   "C": "לאדי",
   "D": 54.603559,
   "E": 31.167353
 },
 {
   "A": " לוינסון, אברהם",
   "B": "פולין",
   "C": "לודג'",
   "D": 51.759249,
   "E": 19.455983
 },
 {
   "A": "שוער, אברהם",
   "B": "לטביה",
   "C": "לוצין",
   "D": 56.545959,
   "E": 27.71432
 },
 {
   "A": "בריינין, ראובן",
   "B": "רוסיה",
   "C": "ליאדי",
   "D": 54.603559,
   "E": 31.167353
 },
 {
   "A": "שטיינברג, יהודה",
   "B": "מולדובה",
   "C": "ליפקאני",
   "D": 48.273339,
   "E": 26.804064
 },
 {
   "A": "בילינסון, משה",
   "B": "רוסיה",
   "C": "לרוסלבל",
   "D": 57.626074,
   "E": 39.884471
 },
 {
   "A": "הכהן, מרדכי בן הלל",
   "B": "בלארוס",
   "C": "מוהילב",
   "D": 53.900716,
   "E": 30.33136
 },
 {
   "A": "ויתקין, יוסף",
   "B": "בלארוס",
   "C": "מוהילב",
   "D": 53.900716,
   "E": 30.33136
 },
 {
   "A": " אטר, משה",
   "B": "רוסיה",
   "C": "מוסקבה",
   "D": 55.755826,
   "E": 37.6173
 },
 {
   "A": " המאירי, אביגדור",
   "B": "אוקראינה",
   "C": "מוקצ'בו",
   "D": 48.449306,
   "E": 22.711711
 },
 {
   "A": "ברדיצ'בסקי, מיכה יוסף",
   "B": "אוקראינה",
   "C": "מז'יבוז'",
   "D": 49.438904,
   "E": 27.404215
 },
 {
   "A": "טשרניחובסקי, שאול",
   "B": "אוקראינה",
   "C": "מיכאילובקה",
   "D": 47.259373,
   "E": 35.218165
 },
 {
   "A": "ציטרון, שמואל ליב",
   "B": "רוסיה",
   "C": "מינסק",
   "D": 53.90454,
   "E": 27.561524
 },
 {
   "A": "כהן, טוביה (טוביה כ\"ץ; טוביה הרופא)",
   "B": "צרפת",
   "C": "מץ",
   "D": 49.119309,
   "E": 6.175716
 },
 {
   "A": "רגלסון, אברהם",
   "B": "ארצות הברית",
   "C": "ניו יורק",
   "D": 40.712784,
   "E": -74.005941
 },
 {
   "A": "מאפו, אברהם",
   "B": "ליטא",
   "C": "סְלובּודְקָה",
   "D": 54.916273,
   "E": 23.816433
 },
 {
   "A": "לוצאטו, אפרים",
   "B": "איטליה",
   "C": "סאן-דניאל",
   "D": 46.157858,
   "E": 13.010011
 },
 {
   "A": "שטרן, אברהם (\"יאיר\")",
   "B": "רוסיה",
   "C": "סובאלק",
   "D": 54.111522,
   "E": 22.930788
 },
 {
   "A": "לוין, שמריהו",
   "B": "בלארוס",
   "C": "סוויסלוץ'",
   "D": 53.035809,
   "E": 24.094273
 },
 {
   "A": "גנסין, אורי ניסן",
   "B": "רוסיה",
   "C": "סטארודוב",
   "D": 52.591684,
   "E": 32.761673
 },
 {
   "A": "ברנפלד, שמעון",
   "B": "אוקראינה",
   "C": "סטינסלב",
   "D": 48.922633,
   "E": 24.711117
 },
 {
   "A": "גולדפאדן, אברהם",
   "B": "אוקראינה",
   "C": "סטרוקונסטנטינוב,",
   "D": 49.754683,
   "E": 27.212159
 },
 {
   "A": "זליגר, יוסף הלוי",
   "B": "אוקראינה",
   "C": "סניאטין",
   "D": 48.446424,
   "E": 25.569911
 },
 {
   "A": "אחד העם  (אשר גינצברג)",
   "B": "אוקראינה",
   "C": "סקווירה",
   "D": 49.732875,
   "E": 29.66429
 },
 {
   "A": "בנבנשת, וידאל",
   "B": "ספרד",
   "C": "סראגוסה",
   "D": 41.648823,
   "E": -0.889085
 },
 {
   "A": "מרקסון, אהרן דוד",
   "B": "ליטא",
   "C": "פִּילוִוישוֹק",
   "D": 54.717919,
   "E": 23.225596
 },
 {
   "A": "לוצאטו, משה חיים (רמח\"ל)",
   "B": "איטליה",
   "C": "פדובה",
   "D": 45.406435,
   "E": 11.876761
 },
 {
   "A": "לוצאטו, שמואל דוד (שד\"ל)",
   "B": "איטליה",
   "C": "פדובה",
   "D": 45.406435,
   "E": 11.876761
 },
 {
   "A": " בן-גוריון, דוד",
   "B": "פולין",
   "C": "פלונסק",
   "D": 52.623013,
   "E": 20.375359
 },
 {
   "A": "שלום עליכם",
   "B": "אוקראינה",
   "C": "פריאסלאב",
   "D": 50.071583,
   "E": 31.450154
 },
 {
   "A": "יערי-פולסקין, יעקב",
   "B": "אוקראינה",
   "C": "פריסלאב",
   "D": 48.816271,
   "E": 28.946199
 },
 {
   "A": "בוקי בן-יגלי (י\"ל קצנלסון)",
   "B": "אוקראינה",
   "C": "צ'רניגוב",
   "D": 51.4982,
   "E": 31.28935
 },
 {
   "A": "אליהשווילי, נתן",
   "B": "גאורגיה",
   "C": "צחינוואלי",
   "D": 42.22146,
   "E": 43.964405
 },
 {
   "A": " שרירא, שושנה",
   "B": "אוקראינה",
   "C": "קוביליאקי",
   "D": 49.151793,
   "E": 34.195387
 },
 {
   "A": " בסוק, משה",
   "B": "ליטא",
   "C": "קובנה",
   "D": 54.898521,
   "E": 23.903597
 },
 {
   "A": "זוטא, חיים אריה",
   "B": "ליטא",
   "C": "קובנה",
   "D": 54.898521,
   "E": 23.903597
 },
 {
   "A": "לונץ, אברהם משה",
   "B": "ליטא",
   "C": "קובנה",
   "D": 54.898521,
   "E": 23.903597
 },
 {
   "A": "יעבץ, זאב",
   "B": "פולין",
   "C": "קולנו",
   "D": 53.407775,
   "E": 21.932649
 },
 {
   "A": "שמואל בן יוסף הנגיד",
   "B": "ספרד",
   "C": "קורדובה",
   "D": 37.888175,
   "E": -4.779383
 },
 {
   "A": "ליליינבלום, משה ליב (מל\"ל)",
   "B": "ליטא",
   "C": "קיידאן ",
   "D": 55.288131,
   "E": 23.957728
 },
 {
   "A": "יאן, אירה",
   "B": "סרביה",
   "C": "קישינב",
   "D": 44.625628,
   "E": 22.650516
 },
 {
   "A": "עמנואל בן שלמה הרומי",
   "B": "איטליה",
   "C": "רומא",
   "D": 41.902784,
   "E": 12.496366
 },
 {
   "A": "ארלוזורוב, חיים",
   "B": "אוקראינה",
   "C": "רומני",
   "D": 50.741509,
   "E": 33.480953
 },
 {
   "A": " אשד, חגי",
   "B": "ישראל",
   "C": "תל אביב",
   "D": 32.0853,
   "E": 34.781768
 },
 {
   "A": "שבזי, שלום",
   "B": "תימן",
   "C": "תעז",
   "D": 13.413117,
   "E": 43.637531
 },
 {
   "A": "לואידור, יוסף",
   "B": "אוקראינה",
   "C": "",
   "D": 48.379433,
   "E": 31.16558
 },
 {
   "A": "ברזילי, יהושע ",
   "B": "בלארוס",
   "C": "",
   "D": 53.709807,
   "E": 27.953389
 },
 {
   "A": " אפרת, ישראל",
   "B": "רוסיה",
   "C": "",
   "D": 61.52401,
   "E": 105.318756
 },
 {
   "A": "שץ, צבי",
   "B": "רוסיה",
   "C": "",
   "D": 61.52401,
   "E": 105.318756
 }
];
